app/controllers/chnmm_login_controller.rb

INSERT INTO "trajectories" ("user_id", "gesture_id", "is_password", "stroke_seq", "exec_num", "points", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"
---
			puts data_source_hash
			puts "--------------------------"
			trace_detail = Trajectory.new(data_source_hash)
			trace_detail.save