app/controllers/chnmm_login_controller.rb

	def verify_user
		base_compare = Hash.new
		single_stroke = Hash.new
		data_source_hash = Hash.new
		small_x = 21474836
		small_y = 21474836

		# collect first x and y co-ordinates of each stroke separately in base_compare
		# initialize single_stroke[] array for each strokes
		# get normalizing co-ordinates of gesture in small_x and small_y
		params[:finger_data].each do |key, value|
			if !base_compare[value[:color]]
				single_stroke[value[:color]] = Array.new
				base_compare[value[:color]] = {color:value[:color], x:value[:x].to_i, y:value[:y].to_i}
			end
			if (value[:x].to_i < small_x)
				small_x = value[:x].to_i
			end
			if (value[:y].to_i < small_y)
				small_y = value[:y].to_i
			end
		end

		# get execution order of different strokes in comparision with x and y plain
		order_array = base_compare.sort_by {|k,v| v[:x]}

		user_detail = User.where(:email => params[:user_name] ).first
		gesture_ids = Trajectory.where(:user_id => user_detail[:id], :is_password => 1 ).pluck("gesture_id")
---
SELECT  "users".* FROM "users" WHERE "users"."email" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["email", "umesh.riverbed@gmail.com"], ["LIMIT", 1]]
SELECT "trajectories"."gesture_id" FROM "trajectories" WHERE "trajectories"."user_id" = $1 AND "trajectories"."is_password" = $2  [["user_id", 1], ["is_password", 1]]

	def login_possible
		user_detail = User.where(:email => params[:user_name] ).first
		login_status = Gesture.where(:user_id => user_detail[:id]).first
---
SELECT  "users".* FROM "users" WHERE "users"."email" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["email", "umesh.riverbed@gmail.com"], ["LIMIT", 1]]
SELECT  "gestures".* FROM "gestures" WHERE "gestures"."user_id" = $1 ORDER BY "gestures"."id" ASC LIMIT $2  [["user_id", 1], ["LIMIT", 1]]