app/controllers/home_controller.rb

	def save_data
		base_compare = Hash.new
		single_stroke = Hash.new
		data_source_hash = Hash.new
		small_x = 21474836
		small_y = 21474836
		final_msg = ""

		# collect first x and y co-ordinates of each stroke separately in base_compare
		# initialize single_stroke[] array for each strokes
		# get normalizing co-ordinates of gesture in small_x and small_y
		params[:finger_data].each do |key, value|
			if !base_compare[value[:color]]
				single_stroke[value[:color]] = Array.new
				base_compare[value[:color]] = {color:value[:color], x:value[:x].to_i, y:value[:y].to_i}
			end
			if (value[:x].to_i < small_x)
				small_x = value[:x].to_i
			end
			if (value[:y].to_i < small_y)
				small_y = value[:y].to_i
			end
		end

		# get execution order of different strokes in comparision with x and y plain
		order_array = base_compare.sort_by {|k,v| v[:x]}

		# get execution sequence id, nth execution of gesture
		exec_id = Trajectory.where(:user_id => authenticate_user![:id], :gesture_id => params[:gesture_id] ).maximum("exec_num")
---
SELECT "trajectories"."exec_num" FROM "trajectories" WHERE "trajectories"."user_id" = $1 AND "trajectories"."gesture_id" = $2  [["user_id", 1], ["gesture_id", 0]]
SELECT MAX("trajectories"."exec_num") FROM "trajectories" WHERE "trajectories"."user_id" = $1 AND "trajectories"."gesture_id" = $2  [["user_id", 2], ["gesture_id", 0]]

			puts data_source_hash
			# puts "--------------------------"
			trace_detail = Trajectory.new(data_source_hash)
			trace_detail.save
---
INSERT INTO "trajectories" ("user_id", "gesture_id", "is_password", "stroke_seq", "exec_num", "points", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"